<?php if (!$GLOBALS['langcache']['fr']) $GLOBALS['langcache']['fr']=array(); $GLOBALS['langcache']['fr']+=array('install.no_warranty_provided_please_read_license_file'=>'LODEL ne vient avec AUCUNE GARANTIE d\'aucune sorte. Lisez le fichier LICENSE s\'il vous pla&icirc;t.','install.howto_install_OTX_on_private_server'=>'Vous pouvez installer vous propre OTX : cela n&eacute;cessite l\'installation de OpenOffice.org et Java sur votre serveur. Cette installation requiert un serveur dedi&eacute; et correctement prot&eacute;g&eacute;. OTX est distribu&eacute; dans un paquetage s&eacute;par&eacute; de Lodel sur <a href="http://www.OTX.net" target="_new">http://www.OTX.net</a>. Lorsque OTX est install&eacute;, entrez les param&egrave;tres de connexion ci-dessous. Si vous installez un OTX, nous vous encourageons à le mettre à disposition du public et &agrave; vous faire enregistrer sur <a href="http://www.lodel.org/" target="_new">http://www.lodel.org</a>.','install.OTX_password'=>'Mot de passe de l\'utilsateur OTX','install.OTX_username'=>'Nom d\'utilisateur OTX','install.OTX_url'=>'URL du OTX','install.dont_configure_OTX'=>'Ne pas configurer de OTX','install.configuration_of_OTX_is_an_option_and_may_be_delayed'=>'L\'utilisation de cette puissante fonctionnalit&eacute; est optionnelle et peut &ecirc;tre configur&eacute;e ult&eacute;rieurement.','install.before_account_creation_configuration_of_OTX_is_option'=>'En attendant de recevoir votre identifiant, vous pouvez choisir de ne pas configurer de OTX.','install.to_create_account_on_public_OTX_check_list_on'=>'Pour obtenir un compte sur un OTX public, veuillez consultez la liste officielle des OTX sur','install.reconfigure_OTX'=>'Reconfigurer le OTX','install.OTX_server_based_on_ooo_and_w2l_grant_conversion_rtf_doc_sxw_to_xhtml'=>'La conversion de documents aux formats RTF, SXW ou DOC en XHTML est r&eacute;alis&eacute;e par un serveur distant (OTX) bas&eacute; sur OpenOffice.org et Writer2Latex.','install.convert_text_processor_files'=>'Conversion de documents issus de traitement de texte','install.if_installation_successfull_on_unlisted_provider_let_it_known'=>'Si vous parvenez &agrave; installer Lodel sur un h&eacute;bergeur qui n\'est pas répertori&eacute; sur <a href="http://www.lodel.org">http://www.lodel.org</a>, merci de le faire savoir &agrave; lodel@lodel.org.','install.howto_configure_to_ease_installation'=>'Les configurations permettent de simplifier l\'installation en l\'adaptant &agrave; un h&eacute;bergeur particulier. S\'il n\'y a pas de configuration adaptée à votre h&eacute;bergeur, choisissez la configuration par d&eacute;faut.','install.comments'=>'Commentaires','install.configuration_name'=>'Nom de la configuration','install.choose_server_configuration_type_compatible_with_your_provider'=>'Choisissez un type de configuration de serveur adapt&eacute;e &agrave; votre h&eacute;bergeur.','install.choose_server_configuration'=>'Choix de la configuration du serveur','install.resolve_problem_before_continue'=>'Veuillez r&eacute;soudre les probl&egrave;mes suivants avant de poursuivre.','install.php_installation_or_configuration_error'=>'Votre installation ou la configuration de PHP ne permettent pas à Lodel de fonctionner correctement. Versions de PHP recommandées : 5.x','install.specify_absolute_path_outside_lodel_file_system_directory_must_be_readeable_by_webserver_security_warning_outside_web_zone'=>'Pr&eacute;cisez un chemin absolu <span class="text-decoration:underline">en dehors l\'arborescence de Lodel</span> (ce répertoire doit &ecirc;tre lisible par le serveur, mais doit être hors de la zone web pour assurer la securité de vos donn&eacute;es).','install.howto_import_huge_files_and_database'=>'Lorsque la base de donn&eacute;es et les fichiers associ&eacute;s atteignent une taille importante, il n\'est pas possible d\'importer les fichiers par un simple formulaire web. Dans ce cas, les fichiers de sauvegarde doivent être d&eacute;pos&eacute;s dans le répertoire d\'import (par ftp par exemple). Si par ailleurs, le serveur web peut &eacute;crire dans ce r&eacute;pertoire, Lodel proposera d\'y stocker les sauvegardes (backup.php). Ce r&eacute;pertoire est donc tr&egrave;s utile pour les sites importants.','install.import_directory'=>'R&eacute;pertoire d\'import','install.no'=>'non','install.yes'=>'Oui','install.howto_symbolic_links_in_lodel'=>'Si votre serveur web supporte les liens symboliques : certains fichiers peuvent &ecirc;tre li&eacute;s plut&ocirc;t que copi&eacute;s. La liaison permet une gestion plus souple des mises &agrave; jour, des droits d\'acc&egrave;s, etc. Ceci ne se justifie <strong>que si Lodel g&egrave;re plusieurs sites</strong>. Il faut, si cela n\'est pas fait, configurer le serveur web pour "suivre les liens symboliques" ce qui est g&eacute;n&eacute;ralement consid&eacute;r&eacute; comme peu s&ucirc;r. Reportez-vous à la documentation du logiciel de votre serveur web (apache par exemple).','install.use_symbolic_links'=>'Utiliser des liens symboliques','install.howto_automatic_account_on_bugs_when_error_dont_appear_on_screen'=>'Lodel peut envoyer un mail quand il rencontre certains bugs et qu\'il ne peut pas afficher l\'erreur à l\'&eacute;cran (c\'est le cas lorsque c\'est un internaute non identifié qui a provoqu&eacute; l\'erreur sur le site). Laissez vide si vous ne souhaitez pas d\'envoi de mail.','install.contact_if_templates_bug'=>'Mail de contact en cas de bug dans les maquettes (templates)','install.howto_on_scripts_extensions_choose_php_or_html_extensions'=>'Les scripts Lodel sont des scripts PHP, et il est recommand&eacute; d\'utiliser l\'extension ".php". Cependant si vous le souhaitez, il est possible de choisir l\'extension ".html". Cette option n\'est pas recommand&eacute;e : elle n&eacute;cessite en particulier une configuration particuli&egrave;re sur le serveur (c\'est à dire que les fichiers html soient analys&eacute;s par php).','install.scripts_extensions'=>'Extension des scripts','install.to_use_unix_zip_unzip_command_specify_access_path_to_command_warning_php_configuration_may_forbid_this_solution'=>'Utilisez les commandes unix zip et unzip. Pour cela, veuillez pr&eacute;ciser les chemins d\'acc&egrave;s vers ces commandes. Attention! Cette solution ne fonctionne pas quand php est en safe-mode ou quand la commande php <code>system</code> est d&eacute;sactiv&eacute;e, ce qui est le cas chez la plupart des h&eacute;bergeurs.','install.it_doesnt_seem_so'=>'ce qui ne semble pas &ecirc;tre le cas','install.it_seems_so'=>'ce qui semble &ecirc;tre le cas','install.to_use_pclzip_check_zlib_extension_is_installed'=>'Utiliser PclZip. Pour cela, assurez-vous que l\'extension zlib est install&eacute;e','install.to_use_OTX_import_or_lodel_backup_system_please_choose_one_of_these_two_options'=>'Si vous souhaitez utiliser ces fonctionalit&eacute;s : l\'import par OTX ou le systeme de sauvegarde de Lodel, veuillez choisir l\'une des deux options','install.zip_archive_function'=>'Fonction d\'archivage ZIP','install.wrting'=>'Ecriture','install.all'=>'les autres','install.reading'=>'Lecture','install.group'=>'groupe','install.comment_about_file_rights_for_lodel'=>'Lorsque le serveur cr&eacute;e des fichiers au cours de l\'installation d\'un site ou lors du fonctionnement normal de Lodel, il est propri&eacute;taire des fichiers, mais il peut aussi ouvrir les droits de lecture et/ou d\'écriture pour le groupe et/ou pour tous les utilisateurs. Ceci permet d\'acc&eacute;der aux fichiers avec un autre utilisateur (par ftp par exemple) : cette option est recommand&eacute;e si vous &ecirc;tes chez un h&eacute;bergeur qui prot&egrave;ge les comptes utilisateurs les uns des autres ou si vous &ecirc;tes l\'unique utilisateur sur le serveur. Dans le cas contraire, il est conseill&eacute; de fermer les droits autant que possible sous peine par exemple de rendre accessibles certains mots de passe.','install.file_rights'=>'Droits sur les fichiers','install.check_url_path_to_lodel_root_is_correct'=>'V&eacute;rifiez que le chemin de l\'url vers la racine de Lodel a &eacute;t&eacute; correctement d&eacute;tect&eacute;','install.options_allow_acute_control_of_lodel_default_values_fit_for_many_websites'=>'Ces options permettent de contr&ocirc;ler finement le fonctionnement de Lodel. Les valeurs par d&eacute;faut conviennent pour la plupart des sites.','install.installation'=>'Installation','install.options'=>'Options diverses','install.lodel_electronic_edition_software'=>'Lodel Logiciel d\'&eacute;dition &eacute;lectronique','install.install_lodel'=>'Installation de Lodel','install.contact_your_provider'=>'contactez votre service technique','install.if_any_doubt'=>'En cas de doute','install.indicated_by_your_provider'=>'ils ont d&ucirc; vous &ecirc;tre communiqu&eacute;s par votre h&eacute;bergeur','install.database_user_and_password'=>'Nom d\'utilisateur MySQL et mot de passe','install.address_given_in_technical_documentation_provided_by_your_provider'=>'son adresse a dû vous &ecirc;tre notifi&eacute;e dans la documentation technique de votre h&eacute;bergeur. Exemple : localhost ou mysql.monhebergeur.com.','install.password_for_database_user'=>'Mot de passe de l\'utilisateur MySQL','install.database_user'=>'Utilisateur MySQL','install.database_server'=>'Serveur MySQL','install.unable_to_connect_to_database_server_error_is'=>'Connection au serveur  impossible. V&eacute;rifiez les informations entr&eacute;es. L\'erreur produite est','install.in_your_case'=>'Dans votre cas','install.for_instance'=>'Par exemple','install.to_create_user_use_grant_command_in_database_server'=>'Pour cr&eacute;er un utilisateur, utiliser la commande GRANT dans mysql (ou phpMyAdmin).','install.give_specification_to_connect_to_database_server_database_user_needs_usage_rights'=>'Sp&eacute;cifiez les param&egrave;tres de connection sur le serveur MySQL. L\'utilisateur MySQL doit avoir au minimum le droits d\'USAGE sur le serveur.','install.give_information_to_connect_to_database'=>'Renseignez les informations permettant &agrave; Lodel de se connecter &agrave; votre base de donn&eacute;es.','install.copy_file_yourself'=>'<strong>Copiez vous-m&ecirc;me le fichier</strong>','install.access_to_database_server'=>'Accès au serveur MySQL','install.visualize'=>'Visualiser','install.visualize_file_howto_copy_file_content_and_save_configuration_file_to_lodel_root'=>'<strong>Visualisez le fichier</strong>, faites un "copier coller" dans un fichier texte nomm&eacute; lodelconfig.php et enregistrez-le ensuite à la racine de Lodel. (Ne laissez aucune ligne après le ?&gt; final).','install.click_on_continue'=>'Ensuite, cliquer sur "Continuer"','install.download'=>'T&eacute;l&eacute;charger','install.download_file_and_save_to_lodel_root'=>'<strong>T&eacute;l&eacute;charger le fichier</strong> puis l\'enregistrer à la racine de Lodel (par ftp par exemple)','install.to_install_configuration_file_choose_one_solution'=>'Pour installer le fichier de configuration, choisissez une des trois solutions','install.file_contains_confidential_password_need_reading_rights_restriction'=>'mais comme il contient des informations confidentielles (mot de passe), il faut restreindre <strong>au maximum</strong> les droits de lecture sur ce fichier.','install.configuration_file_ready_install_on_lodel_root_directory_and_make_it_readable_by_webserver'=>'Le fichier de configuration est pr&ecirc;t, il faut l\'installer dans le r&eacute;pertoire racine de Lodel. Ce fichier doit &ecirc;tre lisible par le serveur web,','install.other_solutions'=>'Alternatives','install.error_occured_while_copying_lodelconfig_file_in_lodel_root_directory_cause_may_be_writing_rights_give_writing_rights_to_lodel_root_directory_or_see_other_solutions'=>'Une erreur est survenue lors de la copie du fichier de configuration "lodelconfig.php" dans le r&eacute;pertoire racine de Lodel. Ceci est probablement d&ucirc; aux droits d\'&eacute;criture sur ces r&eacute;pertoires. Si vous souhaitez que le serveur fasse l\'op&eacute;ration lui-m&ecirc;me, vous devez lui donner les droits d\'&eacute;criture sur le r&eacute;pertoire racine de Lodel. Sinon, reportez-vous aux solutions alternatives ci-dessous.','install.unabale_to_read_lodelconfig_file_on_lodel_root_by_webserver_adjust_rights'=>'Le fichier lodelconfig.php à la racine de Lodel n\'est pas lisible par le serveur web. Veuillez ajuster les droits','install.install_configuration_file'=>'Installation du fichier de configuration','install.no_htaccess_file'=>'Pas de .htaccess','install.verification'=>'V&eacute;rification','install.no_htaccess_file_not_recommended_unless_server_not_support_htaccess_files'=>'Ne pas avoir de \'.htaccess\' (non recommand&eacute; sauf si le serveur ne supporte pas le \'.htaccess\')','install.howto_add_yourself_htaccess_files'=>'Ajouter vous-m&ecirc;me les \'.htaccess\'. A priori, ces fichiers doivent contenir une seule ligne.','install.automatic_installation_htaccess_files'=>'Installation automatique des .htaccess','install.choose_several_possibilities'=>'Plusieurs possibilit&eacute;s s\'offrent à vous','install.let_lodel_install_htaccess_files_in_allowed_directories'=>'Laissez Lodel installer les \'.htaccess\' dans les r&eacute;pertoires o&ugrave; il peut &eacute;crire','install.directories_in_relation_to_lodel_root'=>'R&eacute;pertoire(s) (par rapport à la racine de LODEL)','install.files_not_present_in_following_directories'=>'Ces fichiers ne sont pas pr&eacute;sents dans le(s) r&eacute;pertoires suivants','install.for_security_reason_some_directory_must_contain_htaccess_files'=>'Afin d\'assurer un meilleur niveau de s&eacute;curit&eacute;, certains r&eacute;pertoires doivent contenir un fichier \'.htaccess\' qui emp&ecirc;che l\'accès au r&eacute;pertoire par le web.','install.server_cant_write_htaccess_files_in_following_directories_add_files_yourself_and_click_on_verification'=>'Le serveur ne peut pas &eacute;crire les fichiers \'.htaccess\' dans les r&eacute;pertoires suivants. Veuillez ajouter les fichiers vous-m&ecirc;me et cliquer ensuite sur "V&eacute;rification".','install.directory_relative_path_in_relation_to_lodel_root'=>'Chemin relatif du r&eacute;pertoire inclus automatiquement (relatif par rapport à la racine de LODEL)','install.lodel_pathroot'=>'Chemin absolu de la racine de Lodel','install.warning_guessed_path_by_lodel_make_sure_is_correct_and_not_to_be_modified_without_control'=>'Le chemin indiqu&eacute; ci-dessous a &eacute;t&eacute; "d&eacute;tect&eacute;" par LODEL. Il n\'est pas n&eacute;cessairement correct et, surtout, il n\'est pas n&eacute;cessairement fixe, c\'est à dire qu\'il peut &ecirc;tre chang&eacute; sans pr&eacute;avis par l\'h&eacute;bergeur ou par l\'administrateur syst&egrave;me. Un changement de ce r&eacute;pertoire rendrait l\'ensemble du site inaccessible. En cas de doute utilisez une autre option.','install.option_2'=>'Option 2','install.unable_to_copy_scripts_in_directory'=>'Impossible de copier les scripts dans le r&eacute;pertoire','install.check_input_path_if_not_check_writing_rights_in_parent_directory'=>'V&eacute;rifiez le chemin entr&eacute; ci-dessous. Sinon vérifiez les droits d\'&eacute;criture dans le r&eacute;pertoire parent du répertoire.','install.option_1'=>'Option 1','install.unable_to_access_scripts_through_directory'=>'Impossible d\'acc&eacute;der aux scripts par le r&eacute;pertoire','install.if_access_path_to_lodel_known_and_fixed_specify'=>'Si le chemin d\'acc&egrave;s <u>absolu</u> à LODEL est connu et fixe, pr&eacute;cisez le ci-dessous.','install.option_1_and_2'=>'Option 1 et 2','install.lodel_needs_access_to_scripts_in_directory'=>'LODEL a besoin d\'acc&eacute;der &agrave; des scripts dans un r&eacute;pertoire inclu automatiquement ou dont le chemin absolu est connu et fixe.','install.choose_configuration'=>'Choix de la configuration','install.cancel'=>'Abandonner','install.now_create_website_so_click_to_continue'=>'Vous devez maintenant cr&eacute;er un site, pour cela veuillez cliquer sur Continuer.','install.congratulations_lodel_installation_completed'=>'F&eacute;licitations, Lodel est maintenant install&eacute;.','install.table_prefix'=>'Pr&eacute;fixe des tables','install.single_database_for_all_websites'=>'Base de donn&eacute;es unique pour tous les sites','install.create_new_database'=>'Cr&eacute;er une nouvelle base de donn&eacute;es','install.use_existing_empty_database'=>'Utiliser une nouvelle base de donn&eacute;es qui existe','install.database'=>'Base de donn&eacute;es','install.erase_data'=>'Effacer les donn&eacute;es','install.selected_database_content_data_for_lodel_you_may_save_datas_or_erase_or_select_another_databases'=>'La base que vous avez s&eacute;lectionn&eacute;e contient d&eacute;j&agrave; des donn&eacute;es pour Lodel. Vous pouvez conserver ces donn&eacute;es pour l\'installation actuelle ou les effacer. Vous pouvez aussi s&eacute;lectionner une autre base de donn&eacute;es ci-dessous.','install.warning'=>'Attention','install.table_creation_failed_sql_instruction_and_error_are'=>'La cr&eacute;ation des tables a &eacute;chou&eacute;. L\'erreur MySQL est la suivante :','install.unable_to_use_database_check_databaseuser_rights_error_is'=>'L\'utilisation de cette base de donn&eacute;es ne semble pas possible. L\'utilisateur MySQL a-t-il les droits ? L\'erreur produite est','install.single_database_for_single_website_plus_main_database_recommended_solution'=>'Une base de donn&eacute;es par site, en plus de la base principale. Cette solution est recommand&eacute;e, mais vous devrez alors cr&eacute;er une base de donn&eacute;es pour chaque site.','install.single_database_for_all_websites_advantages_disadvantages'=>'Une unique base de donn&eacute;es pour tous les sites. Cette option simplifie la cr&eacute;ation de nouveaux sites, mais elle interdit ou rend plus d&eacute;licate la restauration en cas de probl&egrave;mes ou le multi-versioning (coexistence de plusieurs sites utilisant diff&eacute;rentes versions de Lodel). Autrement dit, cette option impose la restauration et la migration de tous les sites simultan&eacute;ment.','install.single_lodel_installation_can_manage_several_websites_and_choose'=>'Une seule installation de Lodel peut gérer plusieurs sites en même temps. Pour cela Lodel a besoin de plusieurs bases de données : une base principale, et une base par site. Si vous ne disposez que d\'une base de données, vous ne pourrez donc gérer qu\'un seul site avec Lodel.','install.why_table_prefix'=>'Le pr&eacute;fixe des tables est utile lorsque vous ne disposez que d\'une seule base de donn&eacute;es (comme c\'est souvent le cas chez les hébergeurs) et que d\'autres applications partageront la base de donn&eacute;es avec Lodel. Cette situation rend plus difficiles les migrations et les restaurations : si vous utilisez plusieurs bases, vous pourrez g&eacute;rer plus facilement les sauvegardes.','install.anyway_give_rights_all_to_database_user'=>'Dans tous les cas, il faut donner les droits "ALL" sur la base à l\'utilisateur','install.example_lodeldb'=>'Par exemple lodeldb','install.can_use_existing_database_but_better_create_new_dedicated_lodel'=>'Vous pouvez utiliser une base de donn&eacute;es existante, mais il est pr&eacute;f&eacute;rable de cr&eacute;er une base de donn&eacute;es d&eacute;di&eacute;e à Lodel.','install.provider_usually_creates_database_see_technical_support'=>'En g&eacute;n&eacute;ral, votre base de donn&eacute;es a d&eacute;j&agrave; &eacute;t&eacute; cr&eacute;&eacute;e par votre h&eacute;bergeur. Veuillez vous reporter au support technique de votre h&eacute;bergeur.','install.choose_existing_database_or_create_new'=>'Choisissez une base de donn&eacute;es existante ou cr&eacute;ez en une nouvelle.','install.gnu_gpl_license_link'=>'GNU General Public License : <a href="../COPYING">licence</a>','install.gnu_gpl_license_copy_provided_with_software_if_not_contact_fsf'=>'Un exemplaire de la Licence Publique Générale GNU doit être fourni avec ce programme ; si ce n\'est pas le cas, écrivez à la Free Software Foundation Inc., 675 Mass Ave, Cambridge, MA 02139, Etats-Unis.','install.no_warranty_see_gnu_gpl_license'=>'Ce programme est distribué dans l\'espoir qu\'il sera utile, mais SANS AUCUNE GARANTIE, sans même la garantie implicite de COMMERCIALISATION ou D\'ADAPTATION A UN OBJET PARTICULIER. Pour plus de détails, voir la Licence Publique Générale GNU.','install.opensource_software_gnu_license'=>'Ce programme est un logiciel libre. Vous pouvez le redistribuer et/ou le modifier conformément aux dispositions de la Licence Publique Générale GNU, telle que publiée par la Free Software Foundation ; version 2 de la licence, ou encore (à votre choix) toute version ultérieure.','install.use_conditions'=>'Conditions d\'utilisation','install.more_complex_need_system_admin_skills_read_completely_installationdoc'=>'elle requiert des compétences minimales en administration système. En cas de doute, veuillez consulter la documentation d\'installation.','install.disadvantage'=>'Inconvénient','install.safe_and_configurable_installation_allow_acute_administration_for_filerights_databaserights_and_other_options'=>'elle est s&ucirc;re et configurable. Elle permet une gestion fine des droits sur les fichiers et la base de donn&eacute;es.','install.advanced_installation_for_system_admin_working_on_own_server'=>'L\'installation multisite s\'adresse aux utilisateurs qui peuvent modifier les droits sur leurs fichiers, et créer plusieurs bases de données. Elle permet la gestion de plusieurs sites avec une même installation de Lodel.','install.inconvenience_low_security_level'=>'Inconvénient : le niveau de sécurité n\'est pas élevé.','install.easy_and_fast_option_for_provider_controlling_filerights_security'=>'elle est simple et rapide. Elle convient pour la plupart des hébergeurs associatifs ou commerciaux.','install.advantage'=>'Avantage','install.easy_installation_for_website_provider'=>'L\'installation monosite est d&eacute;di&eacute;e aux installations chez des h&eacute;bergeurs. Elle ne requiert qu\'une base de données. Elle ne permet pas la gestion de plusieurs sites avec une même installation de Lodel.','install.advanced_installation_for_specialists'=>'Installation multisite','install.easy_installation'=>'Installation monosite','install.do_again_advanced_installation_for_specialists'=>'Recommencer une installation multisite','install.do_again_easy_installation'=>'Recommencer une installation monosite','install.continue_begun_installation'=>'Poursuivre l\'installation commenc&eacute;e','install.installation_begun_what_to_do'=>'Une installation a &eacute;t&eacute; commenc&eacute;e, que souhaitez vous faire','install.choose_installation_type'=>'Choix du type d\'installation','install.lodel_opensource_software_gnu_gpl_license_no_warranty_see_use_conditions'=>'Lodel est un logiciel libre soumis à la licence GNU General Public License (GPL). Il est fourni sans aucune garantie. Veuillez consulter les conditions d\'utilisation <a href="#conditions">ci-dessous</a> et la licence <a href="../COPYING">ici</a>','install.continue'=>'Continuer','install.language'=>'Langue','install.the_two_passwd_are_not_identical'=>'Les deux mots de passe ne sont pas identiques','install.confirm_password'=>'Confirmer votre mot de passe','install.password'=>'Mot de passe','install.login'=>'Login','install.error'=>'Erreur','install.create_initial_admin_and_choose_login_password'=>'Cr&eacute;ation d\'un administrateur initial. Choisissez un login (identifiant) et un mot de passe.','install.database_server_address'=>'Adresse du serveur de base de données','install.choose_installation_language'=>'Choix de la langue d\'installation','install.url_format'=>'Format d\'url :','install.specify_url_format_you_can_choose_one_between_path_format_leftid_format_rightid_format_see_below'=>'Spécifiez le format d\'URL souhaité : identifiant à gauche, identifiant à droite et path (identifiant textuel)','install.path_format'=>'URL intelligente (identifiant textuel)','install.leftid_format'=>'Identifiant à gauche','install.rightid_format'=>'Identifiant à droite','install.reading_lodelconfig'=>'Le fichier lodelconfig.php n\'a pas pu être lu. Veuillez vérifier que le serveur Web a les droits en lecture sur ce fichier.','install.lodelconfig_but_no_database'=>'Un fichier de configuration (lodelconfig.php) a été trouvé dans le répertoire principal de Lodel mais ce fichier ne permet pas actuellement d\'accéder à une base de donnée valide. Si vous souhaitez poursuivre l\'installation, veuillez effacer manuellement ce fichier, puis cliquer sur le bouton "Recharger" de votre navigateur.','install.check_directories'=>'Préliminaires : vérifications des répertoires','install.directories_access_speech'=>'Veuillez résoudre les problèmes signalés ci-dessous avant de poursuivre l\'installation.','install.missing_directories'=>'Les répertoires suivants sont manquants','install.not_writable_directories'=>'Les répertoires suivants ne sont pas accessibles en écriture','install.not_readable_directories'=>'Les répertoires suivants ne sont pas accessibles en lecture','install.notice_security_directory_rights'=>'Pour sécuriser votre installation de Lodel, veuillez consulter le chapitre de la documentation  intitulé Installation avancée de Lodel et sécurisation.','install.please_choose_installation_language'=>'Veuillez choisir la langue de l\'installation','install.please_choose_installation_type'=>'Veuillez choisir le type d\'installation.','install.create_initial_admin'=>'Création d\'un administrateur initial','install.please_choose_login_password'=>'Merci de choisir votre login et votre mot de passe.','install.password_and_username_must_not_be_empty'=>'Le mot de passe et le nom d\'utilisateur ne doivent pas être vides','install.erreur_admin_passwd'=>'Le mot de passe doit comporter entre 3 et 12 caractères. Il peut ne peut que comporter des lettres, des chiffres, et les caractères suivants : _ ; . ? ! @ : , &','install.to_lodel_root_and_rename_it_lodelconfig'=>'à la racine de Lodel, et renommez-le lodelconfig.php.','install.warning_better_use_utf8'=>'Afin d\'&eacute;viter tout probl&egrave;me d\'encodage des caract&egrave;res, il est pr&eacute;f&eacute;rable d\'utiliser une base de donn&eacute;es en UTF-8 permettant d\'assurer la compatibilit&eacute; avec Lodel.','install.very_strong_passwd'=>'Très robuste','install.strong_passwd'=>'Robuste','install.very_weak_passwd'=>'Très faible','install.weak_passwd'=>'Faible','install.good_passwd'=>'Bon','install.level_security_passwd'=>'Niveau de sécurité du mot de passe','install.recommandations_for_strenghtpasswd'=>'Recommandations pour un mot de passe sécurisé','install.passwd_min_chars'=>'Votre mot de passe ne doit pas être trop court (8 caractères recommandés)','install.passwd_needs_numbers'=>'Votre mot de passe doit contenir au moins un chiffre','install.passwd_needs_chars'=>'Votre mot de passe doit contenir au moins une lettre','install.passwd_needs_special_chars'=>'Votre mot de passe doit contenir au moins un caractère spécial, choisi parmi ceux-ci : _;.?!@:,&','install.passwd_need_upandlow_chars'=>'Les lettres de votre mot de passe ne doivent pas toutes être de la même casse','install.passwd_needs_other_chars'=>'Votre mot de passe ne doit pas contenir plusieurs fois le même caractère','install.email'=>'Courriel','install.error_invalid_email'=>'Courriel invalide.','install.singleid_format'=>'Identifiant uniquement',); ?>